var arr = [];
arr[0] = {
	"Title":"黄渤  (卅帝、渤哥、影帝)",
	"Introduce":"1974年8月26日出生于山东青岛,北京电影学院表演系配音专业.中国内地男演员、导演、歌手，中国电影家协会副主席。2000年，黄渤出演管虎执导的电视电影《上车，走吧》，这是他的第一部影视作品。2006年凭借宁浩执导的电影《疯狂的石头》而成名   。2009年，凭借《斗牛》获得第46届台湾电影金马奖“最佳男主角奖”",
	"Url":"./images/famous1.jpg",
	"urlList":["./images/huangbo1.jpg","./images/huangbo2.jpg","./images/huangbo3.jpg","./images/huangbo4.jpg"],
	"Characteristic":["《冰之下》","《一出好戏》","《疯狂的外星人》","《疯狂的赛车》","《寻龙诀》","《西游·降魔篇》","《杀生》"]
};
arr[1] = {
	"Title":"黄晓明",
	"Introduce":"黄晓明，1977年11月13日出生于山东省青岛市，中国内地男演员、歌手，毕业于北京电影学院表演系本科班。1998年出演首部电视剧《爱情不是游戏》进入演艺圈。2001年因主演古装剧《大汉天子》而获得关注。2005年入选“福布斯中国名人榜”。2006年主演武侠剧《神雕侠侣》；同年参演电影《夜宴》进军大银幕。2007年凭借民国剧《新上海滩》获得第13届上海电视节白玉兰奖最佳男演员提名；同年发行个人首张专辑。",
	"Url":"./images/famous2.jpg",
	"urlList":["./images/huangxiaoming1.jpg","./images/huangxiaoming2.jpg","./images/huangxiaoming3.jpg","./images/huangxiaoming4.jpg"],
	"Characteristic":["《大汉天子》","《神雕侠侣》","《新上海滩》","《暗香》","《赵氏孤儿》","《无问西东》","《你迟到的许多年》"]
};
arr[2] = {
	"Title":"陈好（万人迷）",
	"Introduce":"陈好，1979年12月9日出生于山东省青岛市，中国内地女演员、主持人、歌手，中国电视艺术家协会演员工会副会长。1997年考入中央戏剧学院表演系本科班。1998年，参演了剧情片《那山、那人、那狗》，这是其真正意义上的“处女作” [1]  。1999年，出任香港凤凰卫视中文台《九州任逍遥》节目主持 [2]  。2000年，出演了古装传奇剧《乱世英雄吕不韦》。2001年，主演了古装喜剧《李卫当官》。2003年4月30日，主演的都市轻喜剧《粉红女郎》播出，陈好凭借该剧获得了第5届中国金鹰电视艺术节最受观众欢迎女演员奖 [3]  ；12月11日，主演的古装武侠爱情剧《天龙八部》首播，陈好因饰演“阿紫”而获得了北京地区春节期间最佳人气女明星奖 [4]  。2004年，主演了都市轻喜剧《双响炮》，凭借该剧获得了第五届大众电视“双十佳”最佳女演员称号 [5]  。2005年10月16日，陈好以歌手的身份推出了首张同名个人专辑《陈好》。2006年，出演了喜剧电影《求求你，表扬我》。2007年，出演了古装宫廷剧《皇上二大爷》。2008年，凭借年代剧《纸醉金迷》获得了第四届首尔国际电视节评审团特别奖 [6]  。2009年，参演了历史电影《建国大业》。2010年3月28日，凭借专辑《幸好》获得了第14届华语榜中榜最佳跨界女歌手奖 [7]  ；5月2日，参演的古装战争剧《三国》首播。2012年，出演话剧《日出》。2013年，主演了都市喜剧《新编辑部故事》。2015年4月29日，主演的都市家庭轻喜剧《待嫁老爸》播出 [8]  。",
	"Url":"./images/famous3.jpg",
	"urlList":["./images/chenhao1.jpg","./images/chenhao2.jpg","./images/chenhao3.jpg","./images/chenhao4.jpg"],
	"Characteristic":["《李卫当官》","《粉红女郎》","《天龙八部》","《双响炮》","《皇上二大爷》","《日出》","《待嫁老爸》"]
};
arr[3] = {
	"Title":"唐国强",
	"Introduce":"唐国强，中国内地影视男演员、导演。现为中国国家话剧院一级演员，中国书法家协会会员，毛泽东特型演员。1979年，因在《小花》中饰赵永生获文化部1979年优秀青年创作奖、“电视十佳演员”、“首届全国百佳电视工作者”获得“金鹰”最佳男主角和“飞天”优秀男演员提名。1985年入北京电影学院表演专修班学习。后在《今夜星光灿烂》、《路漫漫》、《高山下的花环》等影片中扮演角色。 [2]  从1988年开始，陆续参加拍摄《到莫斯科去》、《三国演义》、《雍正王朝》、《开国领袖毛泽东》。1998年，凭借电影《长征》获得第4届中国电影华表奖最佳男演员的称号。2003年，获第22届电视剧飞天奖优秀男演员奖、金鹰奖等。 [3]  2009年，主演献礼影片《建国大业》，饰演毛泽东 [4]  。2013年主演电视剧《毛泽东》。 [5]  2018年1月，主演的大型史诗电视连续剧《换了人间》播出 [6]  。",
	"Url":"./images/famous4.jpg",
	"urlList":["./images/tangguoqiang1.jpg","./images/tangguoqiang2.jpg","./images/tangguoqiang3.jpg","./images/tangguoqiang4.jpg"],
	"Characteristic":["《小花》","《三国演义》","《雍正王朝》","《开国领袖毛泽东》","《今夜星光灿烂》","《到莫斯科去》","《建国大业》"]
};
arr[4] = {
	"Title":"徐良",
	"Introduce":"徐良，1987年2月8日生于山东省青岛市，中国内地男歌手、音乐人。2010年，徐良创作并在网络上发表个人第一首歌《胸前》，受到网友关注。此后，徐良连续发表了《坏女孩》、《客官不可以》、《红装》等歌曲，累计视听量近亿。2011年，徐良签约美妙音乐，发行个人首张专辑《不良少年》。2012年6月，发布歌曲《无颜女》。2013年，发布第二张专辑《情话》。同年，徐良发布了个人首支中国风歌曲《那时雨》。2014年，徐良推出第三张专辑《我》。2015年，徐良参演网络微电影《反恐行动之浪漫满屋》，该片是徐良首次出演影视作品。同年，徐良还为网络剧《诡案》创作、演唱了主题曲《华生》。2016年4月，徐良发行短篇故事集《请在哔声后留言》。7月15日，徐良发行第四张专辑《请在哔声后留言》，该专辑是徐良个人首张全独唱专辑。6月，徐良发行个人第五张全创作概念电音专辑《东西世界》。2018年4月，发行与国家一级演员李玉刚合作的单曲《花魁》，开启了其“超级音乐计划”的序幕。5月，发表第二支单曲《今天见了前女友》 [1]  。7月12日，和汪苏泷合作的电影《快把我哥带走》主题曲《写给妹妹的歌》发行。",
	"Url":"./images/famous5.png",
	"urlList":["./images/xvliang1.jpg","./images/xvliang2.jpg","./images/xvliang3.jpg","./images/xvliang4.jpg"],
	"Characteristic":["《坏女孩》","《一三七》","《胸前》","《客官不可以》","《那时雨》","《反恐行动之浪漫满屋》","《写给妹妹的歌》"]
};
arr[5] = {
	"Title":"林永健",
	"Introduce":"林永健，1970年2月14日生于山东省青岛市，中国内地男演员。中国文学艺术界联合会第十届全委会委员。1997年，参演首部电视作品《和平年代》。2004年，凭借《敌后特工队》汉奸“刘魁胜”夺得第17届全军电视剧金星奖“优秀演员”奖。2006年，凭借《喜耕田的故事》夺得第24届金鹰奖观众喜爱电视剧男演员奖。2012年主演电视剧《我叫王土地》，获得26届金鹰奖“观众喜爱的电视剧男演员奖 ”。",
	"Url":"./images/famous6.jpg",
	"urlList":["./images/linyongjian1.jpg","./images/linyongjian2.jpg","./images/linyongjian3.jpg","./images/linyongjian4.jpg"],
	"Characteristic":["《王贵与安娜》","《喜耕田的故事》","《林师傅在首尔》","《黎明之前》","《和平年代》","《敌后特工队》","《装修》"]
};
arr[6] = {
	"Title":"张继科",
	"Introduce":"张继科，1988年2月16日出生于山东省青岛市，中国男子乒乓球队运动员。他是乒坛历史上第7位大满贯选手，也是继刘国梁、孔令辉后的中国男乒史上第3位大满贯选手。2000年，进入山东鲁能乒乓球队。2002年3月，进入国家二队；10月，获得首届世界少年挑战赛男子单打冠军 [1]  。2003年1月，进入国家一队；9月，获得世界青少年巡回赛新西兰公开赛决赛冠军。2004年10月，因违反队规被退回省队。2006年11月，重回国家队。2008年，在全国锦标赛中以全胜战绩为解放军队获得男团冠军。2009年，在世界杯团体赛上获得首个世界冠军。2011年，在鹿特丹世乒赛男子单打决赛中赢得职业生涯首个世乒赛男单冠军。2012年，获得世界乒乓球团体锦标赛冠军；8月，在伦敦奥运会中获得男子单打冠军，实现了世锦赛、世界杯、奥运会三项个人冠军的大满贯。2013年，获得巴黎世乒赛男单冠军 [4]  。2014年，在仁川亚运会搭档马龙夺得男子双打冠军，在德国乒乓球世界杯中夺得第2个世界杯男单冠军 [5]  。2016年8月，在里约热内卢奥运会中获得乒乓球男子单打亚军和团体冠军。2017年，在江苏无锡带伤复出获得亚洲乒乓球锦标赛男团冠军、男子单打季军；10月，他获得2017年度大本钟奖体育类（赫拉特勒斯奖）十佳华裔运动员",
	"Url":"./images/famous7.jpg",
	"urlList":["./images/zhangjike1.jpg","./images/zhangjike2.jpg","./images/zhangjike3.jpg","./images/zhangjike4.jpg"],
	"Characteristic":["世界青少年巡回赛新西兰男单冠军","亚洲青少年锦标赛团体冠军","全国优秀青少年调赛中获得单打冠军","全国锦标赛上打进八强","胜率榜的前三位","首个世界冠军","世锦赛、世界杯、奥运会三项冠军的大满贯"]
};
arr[7] = {
	"Title":"范冰冰",
	"Introduce":"范冰冰，1981年9月16日出生于山东青岛，华语影视女演员、制片人、歌手，毕业于上海师范大学谢晋影视艺术学院。1996年出演电视剧《女强人》，1998年主演电视剧《还珠格格》获得广泛关注，2002年主演电影《一见钟情》涉足影坛。2004年凭借冯小刚执导的电影《手机》获得第27届大众电影百花奖最佳女主角。2005年发行首张个人专辑《刚刚开始》。2007年凭借电影《心中有鬼》获得第44届台湾电影金马奖.",
	"Url":"./images/fanbingbing.jpg",
	"urlList":["./images/fanbingbing1.jpg","./images/fanbingbing2.jpg","./images/fanbingbing3.jpg","./images/fanbingbing4.jpg"],
	"Characteristic":["《女强人》","《还珠格格》","《一见钟情》","《心中有鬼》","《我不是潘金莲》","《苹果》","《观音山》"]
};
arr[8] = {
	"Title":"黄子韬",
	"Introduce":"黄子韬，1993年5月2日出生于山东省青岛市，中国流行乐男歌手、演员、主持人。2011年12月27日，以TAO为艺名首次公开亮相。2012年4月，正式出道。2014年10月10日，参加SBS户外探险真人秀节目《金炳万的丛林法则》。2015年6月11日，黄子韬Z.TAO工作室正式成立；7月20日，发行首张个人数字专辑《T.A.O》；8月8日，黄子韬凭借歌曲《Yesterday》获得CCTV全球中文音。",
	"Url":"./images/huangzitao.jpg",
	"urlList":["./images/huangzitao1.jpg","./images/huangzitao2.jpg","./images/huangzitao3.jpg","./images/huangzitao4.jpg"],
	"Characteristic":["《金炳万的丛林法则》","《Yesterday》","《夏天19岁的肖像》","《真正男子汉第二季》","《铁道飞虎》","《谈判官》","《租界少年热血档案》"]
};
var Url = window.location.search;
var Num = Url.substring(Url.length-1);
Num = Num*1;
console.log(Num);
window.onload=function(){
	$('.detailsTitle').text(arr[Num].Title);
	$('.detailsLeftText').text(arr[Num].Introduce);
	$('.detailsImg').attr('src',arr[Num].Url);
	for(let i=0;i<arr[Num].urlList.length;i++){
		$('.ImgList:nth('+i+')').attr('src',arr[Num].urlList[i]);
	}
	for(let i=0;i<arr[Num].Characteristic.length;i++){
		$('.Characteristic:nth('+i+')').text(arr[Num].Characteristic[i]);
	}
}